Revit 2024 API
FabricationConfigurationInfo.IsCloudConfiguration Property
 Whether the cloud configuration is a remote cloud one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool IsCloudConfiguration { get; }
Visual Basic
Public ReadOnly Property IsCloudConfiguration As Boolean
	Get
Visual C++
public:
property bool IsCloudConfiguration {
	bool get ();
}
See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace